# Вводим эту команду в терминал
pip install requests bs4 pyTelegramBotAPI


from bs4 import BeautifulSoup
import requests
import telebot


# Это URL-адрес веб-страницы, с которой мы хотим получить данные.

# Здесь мы используем библиотеку requests для отправки GET-запроса
# к указанному URL-адресу и получения ответа.
# Если получили статус 200 - то все пошло отлично и страница доступна.

# Мы передаем текст ответа от сайта (response.text)
# и указываем парсер, который будет использоваться ("lxml"),
# чтобы создать объект BeautifulSoup для дальнейшего анализа HTML-кода.

# Здесь мы ищем все нужные элементы на странице
# и сохраняем их в переменные.
